Repository: jimregan/citizens-information-raw
Catalog: en-ga/www.citizensinformation.ie/ga/housing/owning_a_home/mortgage_arrears/consumer_protection_codes_and_mortgages.html.txt.tmx
Source language: en
Languages: ga

source: The Housing (Miscellaneous Provisions) Act 2009 provides that where you owe money to a local authority either for rent or loan repayments and the local authority is satisfied that you would otherwise suffer undue hardship, it may make an arrangement with you to repay by instalments
ga: Forálann Acht na dTithe (Forálacha Ilghnéitheacha), 2009 sa chás go bhfuil airgead gan íoc agat le húdarás áitiúil de bharr cíosa nó de bharr aisíocaíochtaí iasachta, agus go dtuigeann an t-údarás áitiúil go mbeifeá thíos le cruatan míchuí murach sin, féadfaidh siad socrú a dhéanamh leat go n-aisíocfaidh tú iad trí thráthchodanna

source: This section (Section 34) is in effect with respect of loan repayments since 14 June 2010 but not in respect of rent
ga: Tá feidhm ag an alt seo (Alt 34) i gcás socruithe maidir le haisíocaíochtaí iasachta ón 14 Meitheamh 2010 i leith ach níl feidhm aige maidir le cíos
